app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
  @user.rpx_identifier = @rpx_identifier = session[:rpx_identifier] if session[:rpx_identifier]
  if @user.save
---
INSERT INTO `users` (`single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('orDgC6Vggxyl3nnvPLUE', '2011-01-01 08:14:24', '2011-01-01 08:14:24', 'ee028c5a4f3aef1da0d442f8865f4115fcf2da7cb53ec7d4a068d55d0edc0804acc14ddf1aa8e818da6b76b158624bc083232db58064b421cf8001fa2ffaec34', 'Pxr44LTF3zeLLflCaO', '2011-01-01 08:14:24', 0, '127.0.0.1', 'UPTpVOYi9sfEZCg2ODE', '2011-01-01 08:14:24', '02abd3dd881ae1449b07f85a640ff13a50489495e8bdd21df9ec8142eee130f88d1d6f538623bdb11ad78ba3ba81f12d6d629972b6841189186bb2910e3ab3eb', 1, NULL, 'thiyagarajan', NULL, 'thiyagarajannv@gmail.com')