app/controllers/user_sessions_controller.rb

  def create

  @user_session = UserSession.new(params[:user_session])

  if @user_session.save
---
INSERT INTO `users` (`single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `rpx_identifier`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('NCpj6lXv1C41h9NqGGJ8', NULL, '2011-01-20 18:51:41', NULL, 'lIat9SWKPnPUDumwtRAe', '2011-01-20 18:51:41', 0, NULL, NULL, NULL, '89c3c0554305c6633e30a96058b7257d78ecd902c08fc131b3d4e3be9ba15e4b0269b36d6a6e120d5f8c9a65ae537628399d5d700ce16d0ae4d076aaecc72b87', 0, 'https://www.google.com/profiles/111768720791554689410', NULL, 'thiyagarajanmpt', NULL, 'thiyagarajanmpt@gmail.com')